[
  {
    "title": "The Big Mouth",
    "description": "A video streaming platform build for The Big House Theatre Company. The platform  offers users the ability to stream their favorite shows, complemented by an innovative x-ray feature providing real-time details about actors and their roles. The VideoHub page enables seamless video uploads directly from user devices using S3 presigned URLs, with administrators empowered to approve, review, and delete content.",
    "details": ["React", "MUI", "Auth0", "AWS "],
    "image": ["https://bedis-portfolio.s3.eu-west-2.amazonaws.com/1.png"],
    "github": "https://github.com/JoeWeate/thebigmouth",
    "liveview": "https://www.hackyourfuture.co.uk/"
  },
  {
    "title": "Avanart",
    "description": " This project aims to develop a unique, customisable avatar generator and sharing system for Code Your Future members, allowing users to create and easily recognize CYF-branded avatars across various platforms while ensuring accessibility and high-performance standards.",
    "details": ["TypeScript", "React", "Tailwind", "SCSS"],
    "image": ["https://bedis-portfolio.s3.eu-west-2.amazonaws.com/2.png"],
    "github": "https://github.com/Bedi06/Avanart",
    "liveview": "https://avanart.netlify.app/"
  },
  {
    "title": "Video Recommendations",
    "description": "A user-friendly platform that lets you securely save, rate, and organise your favourite videos. With advanced search and filtering options and seamless integration of Amazon EC2, RDS, PostgreSQL, React, and Bootstrap technologies, managing your video collection has never been easier.",
    "details": ["React", "EC2", "PSQL", "RDS", "Terraform", "Github Actions"],
    "image": ["https://bedis-portfolio.s3.eu-west-2.amazonaws.com/3.png"],
    "github": "https://github.com/Bedi06/Video-Recommandations-App",
    "liveview": "http://video-recommandations.s3-website.eu-west-2.amazonaws.com/"
  },
  {
    "title": "Countries Explorer",
    "description": "Countries Explorer is an intuitive app offering country search and filtering by continent. With dark and light mode options, users can easily access detailed country information and flags, all powered by APIs, Bootstrap, and React.",
    "details": ["API", "React", "Bootstrap"],
    "image": ["https://bedis-portfolio.s3.eu-west-2.amazonaws.com/4.png"],
    "github": "https://github.com/Bedi06/Countries-Explorer",
    "liveview": "https://cyf-bedi06-countries-react.netlify.app/"
  }
]
